## class no 3

### Pandas Basics

###### what is pandas?

###### Pandas is a powerful library for data manipulation(organizing or arranging data in order to make it easier to interpret) and analysis

#### 1. Pandas Loading

In [12]:

import pandas as pd
import seaborn as sns

#### 2. Data reading

In [13]:
sayaray = sns.load_dataset("planets")

In [15]:
sayaray.to_csv("data_planets")

In [16]:
ds = pd.read_csv("data_planets")

In [17]:
ds

,Unnamed: 0,method,number,orbital_period,mass,distance,year
0,0,Radial Velocity,1,269.300000,7.10,77.40,2006
1,1,Radial Velocity,1,874.774000,2.21,56.95,2008
2,2,Radial Velocity,1,763.000000,2.60,19.84,2011
3,3,Radial Velocity,1,326.030000,19.40,110.62,2007
4,4,Radial Velocity,1,516.220000,10.50,119.47,2009
...,...,...,...,...,...,...,...
1030,1030,Transit,1,3.941507,NaN,172.00,2006
1031,1031,Transit,1,2.615864,NaN,148.00,2007
1032,1032,Transit,1,3.191524,NaN,174.00,2007
1033,1033,Transit,1,4.125083,NaN,293.00,2008
1034,1034,Transit,1,4.187757,NaN,260.00,2008

###### Online reading/ by link reading:

In [18]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'

online_data = pd.read_csv(url, sep='\t')
online_data.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [19]:
# saving to apna folder
online_data.to_csv("khana.csv",index=False)

## task

#### Make data frame using pandas

In [36]:
# Create a list of list with 3 columns and 6 rows each
asiacup_2023 = [['bangladesh',265 ,8],['india', 213, 10], ['pakistan',342, 6 ], ['srilanka' , 165, 5], ['afghanistan', 245, 10], ['nepal',230 , 10] ]
df = pd.DataFrame(asiacup_2023, columns=['country_name', 'score', 'wickets'])
df

  country_name  score  wickets
0   bangladesh    265        8
1        india    213       10
2     pakistan    342        6
3     srilanka    165        5
4  afghanistan    245       10
5        nepal    230       10

#### 3. Basic pandas dataframe operations/functions

In [20]:
# data glimpse
sayaray.head()
sayaray.tail()

       method  number  orbital_period  mass  distance  year
1030  Transit       1        3.941507   NaN     172.0  2006
1031  Transit       1        2.615864   NaN     148.0  2007
1032  Transit       1        3.191524   NaN     174.0  2007
1033  Transit       1        4.125083   NaN     293.0  2008
1034  Transit       1        4.187757   NaN     260.0  2008

In [21]:
# size of the data
sayaray.shape

#row values of the data
sayaray.shape[1]

6

In [22]:
# sample random 
small_data = sayaray.sample(frac=0.05)
small_data.head()

              method  number  orbital_period  mass  distance  year
180          Transit       2        5.005425   NaN    354.00  2011
679          Transit       2        9.286994   NaN   2119.00  2011
401  Radial Velocity       1     4951.000000   6.8     42.77  2012
823          Transit       7      210.606970   NaN    780.00  2013
939  Radial Velocity       1        4.426400   NaN       NaN  2012

In [23]:
# columns of the data
small_data.columns

Index(['method', 'number', 'orbital_period', 'mass', 'distance', 'year'], dtype='object')

In [24]:
small_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 52 entries, 180 to 572
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          52 non-null     object
 1   number          52 non-null     int64
 2   orbital_period  51 non-null     float64
 3   mass            31 non-null     float64
 4   distance        46 non-null     float64
 5   year            52 non-null     int64
dtypes: float64(3), int64(2), object(1)
memory usage: 2.8+ KB

In [26]:
# stat for the data
small_data.describe() # only numerical data
small_data.describe(include='all')

,method,number,orbital_period,mass,distance,year
count,52,52.000000,51.000000,31.000000,46.000000,52.000000
unique,4,NaN,NaN,NaN,NaN,NaN
top,Radial Velocity,NaN,NaN,NaN,NaN,NaN
freq,36,NaN,NaN,NaN,NaN,NaN
mean,NaN,1.807692,756.351775,4.101226,211.388913,2008.346154
std,NaN,1.328990,1439.454832,5.403142,420.366239,4.838103
min,NaN,1.000000,1.338232,0.014000,6.800000,1992.000000
25%,NaN,1.000000,8.958997,0.707000,32.932500,2007.000000
50%,NaN,1.000000,210.606970,2.300000,76.735000,2009.000000
75%,NaN,2.000000,704.350000,5.300000,138.875000,2011.250000
max,NaN,7.000000,7100.000000,21.420000,2119.000000,2014.000000

In [27]:
# reindexing of small data
new_index = range(1,11)
small_data = small_data.reset_index(drop=True).reindex(new_index)

In [28]:
small_data.head()

            method  number  orbital_period  mass  distance  year
1          Transit       2        9.286994   NaN   2119.00  2011
2  Radial Velocity       1     4951.000000   6.8     42.77  2012
3          Transit       7      210.606970   NaN    780.00  2013
4  Radial Velocity       1        4.426400   NaN       NaN  2012
5    Pulsar Timing       3       66.541900   NaN       NaN  1992

In [29]:
# select a single column9
small_data[['method','orbital_period']]
small_data['orbital_period'].unique()

# groupby function -- group orbotal period wrt method
# loc vs iloc

array([9.2869944e+00, 4.9510000e+03, 2.1060697e+02, 4.4264000e+00,
       6.6541900e+01, 1.8783000e+02, 1.3140000e+03, 1.2890000e+03,
       3.7963000e+02, 5.0000000e+02])

In [30]:
# null values
small_data.isnull().sum()

method            0
number            0
orbital_period    0
mass              5
distance          3
year              0
dtype: int64

In [31]:
# duplicate
small_data.duplicated().sum()

0